#ม.5 กันต์ เอกอนันต์ พูมดีสิทธินนท์ Email: aekanan2004@gmail.com
import random

print("หวัดดีจ้าลูก! วันนี้จะกินไรเดี๋ยวป้าทำให้")
a = input('พิมพ์ "Food" ถ้านึกไม่ออกว่าจะกินไร: ')

def random_some_number():
  return int(random.random() * 10)

foods = ['ข้าวผัดหมูไข่ดาว',"ผัดกะเพราเนื้อ",'ข้าวมันไก่ทอด','ซูชิ','ก๋วยเตี๋ยว','ไก่กระเทียม','ไก่ย่าง','ผัดผริกอ่อน','หมูกระทะ','ชาบู','ทอดไข่กินเองซะะะะะะะะ',"ไดเอทลดน้ำหนักเก็บตัง"]

if a == "Food":
    print("แท่น!แท๊น! เมนูวันนี้คือ: " +foods[random_some_number()])

if a != "Food" :
    print('เอ้าก็บอกว่าให้พิมพ์คำว่า "Food"')
    a = input('พิมพ์คำว่า "Food" เร็ว! มีคนต่อแถวรออยู่ ป้าจะได้ทำให้: ')
    print("โอเคงั้นป้าจะทำ :" +foods[random_some_number()])

    













